{
  "hero-sub-heading": "Front-end developer from Ireland based in Seville, Spain",
  "hire-me-button": "HIRE ME",
  "what-i-do-header": "What I Do",
  "design-and-develop": "Design & Develop",
  "design-and-develop-text": "Create modern, personalised designs and develop custom solutions to provide an alternative to expensive drag-and-drop website providers",
  "responsive-design": "Responsive Design",
  "responsive-design-text": "Develop mobile-first sites that look great on all devices and ensure optimal user experience",
  "seo-analytics": "SEO & Analytics",
  "seo-analytics-text": "Focus on performance, accessibility and best practices to can make your website fast, easy to find, and reach the widest audience possible",
  "e-commerce": "E-commerce",
  "e-commerce-text": "Integrate e-commerce platform payment gateways with custom product templates allowing you to maintain full control of your business",
  "works-header": "Works",
  "description": "Description",
  "difficulties": "Difficulties",
  "solutions": "Solutions",
  "notable-features": "Notable Features",
  "project-stack": "Project Stack",
  "read-more": "Read more",
  "read-less": "Read less",
  "view-site": "View Site",
  "view-extension": "View Extension",
  "st-blurb": "Designed and developed personalised e-commerce site based on client's vision and halved their monthly website fees. Shopify was integrated to handle secure payments, product inventory and to provide the client with control of the business",
  "st-description": "Client had created a site with a drag-and-drop website provider that achieved a high volume of visitors but a low conversion rate. The site required a personal design and identity that matched the product but the limited available options made the site look outdated and as a result customers did not find it trustworthy. I designed and developed the site based on the clients ideas and integrated a Shopify Lite, giving their site an identity and a reduction in monthly subscription fees.",
  "st-difficulties": "The client's original site lacked structure and a natural flow that would make navigation easier for users and lead to increased sales. The client needed the freedom to add and edit products, add discounts and control shipping fees. They also required a blog and a partner site information page they cold update freely. Most importantly, the client was looking for a cheaper alternative to the service they were using as the subscription fees continued to rise and there was a product limit.",
  "st-solutions": "The site was completely redesigned from scratch, creating a more cohesive and consistent structure while maintaining the personal feel of the original site. It was designed to highlight the key areas client wanted more traffic and provide a flow that makes navigation easier for the users. By integrating a Shopify Lite store, I was able to give the client full control of the business with no product limit. Any changes made on Shopify would dynamically update the information on their new site. By hosting the site on Heroku, I was able to provide a secure service with SSL certification to make it trustworthy. Using the above services led to the client's monthly fees being reduced to less than half of what they had been paying for their previous site.",
  "st-nf-1": "Secure payments with Shopify",
  "st-nf-2": "Full control of product inventory, shipping, pricing and discounts",
  "st-nf-3": "Custom products",
  "st-nf-4": "Personalised, fully responsive design",
  "st-nf-5": "Product filtering",
  "st-nf-6": "Dynamically add material list to each product with images",
  "st-nf-7": "Secret log in for client to add/edit blogs and links to partner sites",
  "st-nf-8": "Custom client email and domain",
  "st-nf-9": "Sessions to store cart and wishlist for returning customers",
  "st-nf-10": "SSL certification",
  "dc-blurb": "Daily Chess Puzzle chrome extension allows users to solve chess.com's daily puzzle directly from the browser. It also gives users unlimited access to the daily puzzle archives for free. Daily Chess Puzzle currently has ~150 weekly users",
  "dc-description": "Most chess experts claim that solving chess puzzles is the most effective chess training method to improve your chess skills. So I wanted to develop a free chrome extension that would allow the user to improve their chess conveniently from the browser.",
  "dc-difficulties": "Most chess application require a paid membership to have unlimited access to puzzles. So I needed to find a way to import the puzzle data for free. Puzzle data is in PGN format so this data would then need to be parsed and divided into individual moves. All potential moves needed to be incorporated, for example, castling on both sides and pawn promotion. It also needed to look familiar and function similarly immediately.",
  "dc-solutions": "chess.com's chess-web-api provided the data for their daily puzzle in PGN notation. This data was parsed and separated into individual moves with regular expressions. chessboard.js was used to generate the chessboard with moveable pieces and chess.js was used for the chess logic and rules. With chess.js, you can view the current position in PGN notation. Using these three packages I was able to set the starting position and allow the user to make a move, the PGN of which was then compared to the expected value. If the move matched, the puzzle continued. If not, the user is shown an incorrect move message and asked to try again. The style and controls were made to match chess.com for familiarity. The chess-web-api also releases the notation for a random daily puzzle from the archives, which updates every 15 seconds allowing unlimited free access to past puzzles.",
  "dc-nf-1": "Unlimited free puzzles",
  "dc-nf-2": "Direct access from the browser",
  "dc-nf-3": "Familiar chess.com style",
  "dc-nf-4": "No membership/subscription necessary",
  "dc-nf-5": "Hints, solution, reset and rotate board buttons",
  "dc-nf-6": "Direct links to chess.com for more information",
  "dc-challenge": "Challenge Me!",
  "go-blurb": "Goals web application allows users to track yearly goals and see their progress in real time. Whether you want to achieve something or kick a bad habit, this application will help you stay focused",
  "go-description": "Updates on your progress are essential to keeping you motivated to achieve your goals. This application allows you to track and view your progress in real time, regardless of the type of goal. Goals are divided into categories to maintain focus on all goals.",
  "go-difficulties": "Not all goals can be measured in the same way. If you would like to quit or achieve something, they need to be tracked in different ways. Some goals can be marked with a checkbox, while others may need to be shown with a target value. With target values, users need to be able to write notes to reflect on how they have progressed.",
  "go-solutions": "Users add sub-goals to the goal categories which make up the percentage complete value. Checked and target sub-goals are weighted evenly, with the percentage completion of the targets being immediately added to the goal percentage. This allows for a more accurate representation of user progress. For example, if you plan to run 1,000km in a year, the percentage completion will be updated with each entry and not only when the target is reached. Notes can be added to the targets to keep track of your progress. Goals can be organised as the user sees fit and sub-goals are moved to the bottom upon completion to shift focus to the next goal.",
  "go-nf-1": "Real-time goal updates",
  "go-nf-2": "Set goals to achieve or quit something",
  "go-nf-3": "Target sub-goals for tracking quantity with notes",
  "go-nf-4": "Checkbox sub-goals for simple complete/incomplete goals",
  "go-nf-5": "Percentage wheels and bars with animations",
  "go-nf-6": "Organise goals",
  "go-nf-7": "Save to localStorage",
  "go-nf-8": "Motivational quotes",
  "skills-header": "Skill Set",
  "front-end": "Front-end",
  "back-end": "Back-end",
  "general": "General",
  "languages": "Languages",
  "en-name": "English",
  "en-level": "Native",
  "es-name": "Spanish",
  "pt-name": "Portuguese",
  "currently-learning": "Currently Learning",
  "get-in-touch": "Get in touch!",
  "name": "Name",
  "email": "Email",
  "phone": "Phone",
  "services": "What services are you interested in?",
  "web-dev": "Website Development",
  "web-update": "Website Update",
  "other": "Other",
  "web-url": "Website URL",
  "message": "Message",
  "submit": "Send",
  "thank-you": "Thank You!",
  "success-message": "I'll get back to you as soon as possible"
}
