{
  "hero-sub-heading": "Desarrollador Front-end irlandés afincado en Sevilla, España",
  "hire-me-button": "CONTRÁTEME",
  "what-i-do-header": "Lo Que Hago",
  "design-and-develop": "Diseño y Desarrollo",
  "design-and-develop-text": "Creo diseños modernos y personalizados y desarrollo soluciones a medida para ofrecer una alternativa a los costosos proveedores de sitios web 'drag-and-drop'",
  "responsive-design": "Diseño Responsivo",
  "responsive-design-text": "Desarrollo sitios web 'mobile-first' que se ven muy bien en todos los dispositivos y garantizan una experiencia de usuario óptima",
  "seo-analytics": "SEO y Analítica",
  "seo-analytics-text": "Me concentro en el rendimiento, la accesibilidad y las mejores prácticas para que su sitio web sea rápido, fácil de encontrar y llegue a la mayor audiencia posible",
  "e-commerce": "E-commerce",
  "e-commerce-text": "Integro las pasarelas de pago de las plataformas de comercio electrónico con plantillas de productos personalizadas que le permiten mantener el control total de su negocio",
  "works-header": "Proyectos",
  "description": "Descripción",
  "difficulties": "Dificultades",
  "solutions": "Soluciones",
  "notable-features": "Características Destacadas",
  "project-stack": "Stack del Proyecto",
  "read-more": "Leer más",
  "read-less": "Leer menos",
  "view-site": "Ver sitio",
  "view-extension": "Ver la extensión",
  "st-blurb": "Diseñé y desarrollé un sitio de comercio electrónico personalizado basado en la visión del cliente y reduje a la mitad las tarifas mensuales de su sitio web. Se integró Shopify para gestionar los pagos seguros, el inventario de productos y proporcionar al cliente el control del negocio.",
  "st-description": "El cliente había creado un sitio con un proveedor de sitios web 'drag-and-drop' que conseguía un gran volumen de visitantes pero una baja tasa de conversión. El sitio requería un diseño personal y una identidad que encajara con el producto, pero las limitadas opciones disponibles hacían que el sitio pareciera anticuado y, como resultado, los clientes no lo encontraban fiable. Diseñé y desarrollé el sitio basándome en las ideas de los clientes e integré una tienda de Shopify Lite, dándole una identidad a su sitio y una reducción en las cuotas mensuales de suscripción.",
  "st-difficulties": "El sitio original del cliente carecía de estructura y de un flujo natural que facilitara la navegación a los usuarios y permitiera aumentar las ventas. El cliente necesitaba la libertad de añadir y editar productos, añadir descuentos y controlar los gastos de envío. También necesitaba un blog y una página de información sobre los socios que pudiera actualizar libremente. Y lo que es más importante, el cliente buscaba una alternativa más barata al servicio que utilizaba, ya que las tarifas de suscripción aumentaban constantamente y había un límite de productos.",
  "st-solutions": "El sitio se rediseñó por completo desde cero, creando una estructura más cohesionada y coherente, pero manteniendo la sensación personal del sitio original. Se diseñó para destacar las áreas clave que el cliente quería que tuvieran más tráfico y proporcionar un flujo que facilitara la navegación a los usuarios. Al integrar una tienda de Shopify Lite, pude darle al cliente el control total del negocio sin límite de productos. Cualquier cambio realizado en Shopify actualizaría dinámicamente la información en su nuevo sitio. Al alojar el sitio en Heroku, pude proporcionar un servicio seguro con certificación SSL para que fuera confiable. El uso de estos servicios hizo que las cuotas mensuales del cliente se redujeran a menos de la mitad.",
  "st-nf-1": "Pagos seguros con Shopify",
  "st-nf-2": "Control total del inventario de productos, envíos, precios y descuentos",
  "st-nf-3": "Productos personalizados",
  "st-nf-4": "Diseño personalizado y totalmente responsivo",
  "st-nf-5": "Filtrado de productos",
  "st-nf-6": "Adición dinámica de la lista de materiales a cada producto con imágenes",
  "st-nf-7": "Inicio de sesión secreto para que el cliente pueda añadir/editar blogs y enlaces a sitios asociados",
  "st-nf-8": "Correo electrónico y dominio personalizados del cliente",
  "st-nf-9": "Sesiones para guardar el carrito y la lista de deseos para los clientes que regresan",
  "st-nf-10": "Certificación SSL",
  "dc-blurb": "La extensión chrome Daily Chess Puzzle permite a los usuarios resolver el ejercicio diario de chess.com directamente desde el navegador. También ofrece a los usuarios acceso ilimitado a los archivos del ejercicio diario de forma gratuita. Daily Chess Puzzle es una extensión destacada en la Chrome Store y actualmente cuenta con más de 250 usuarios semanales.",
  "dc-description": "La mayoría de los expertos en ajedrez afirman que la resolución de ejercicios es el método de entrenamiento de ajedrez más eficaz para mejorar sus habilidades. Por eso, he querido desarrollar una extensión gratuita para Chrome que permita al usuario mejorar su ajedrez cómodamente desde el navegador.",
  "dc-difficulties": "La mayoría de las aplicaciones de ajedrez requieren una membresía de pago para tener acceso ilimitado acceso ilimitado a los rompecabezas. Así que necesitaba encontrar una manera de importar los datos de los rompecabezas de forma gratuita. Los datos de los rompecabezas están en formato PGN por lo que estos datos tendrían que ser analizados y divididos en jugadas individuales. Todos los movimientos potenciales  por ejemplo, el enroque en ambos lados y la promoción de peones. promoción de peones. También era necesario que el aspecto y el funcionamiento fueran similares a los de los principales sitios web de ajedrez. de los principales sitios de ajedrez, para que los usuarios se sintieran cómodos utilizándolo inmediatamente.",
  "dc-solutions": "La chess-web-api de chess.com proporcionó los datos para su ejercicios diario en notación PGN. Estos datos se analizaron y se separaron en jugadas individuales con expresiones regulares. Se utilizó chessboard.js para generar el tablero de ajedrez con piezas movibles y chess.js para la lógica y las reglas del ajedrez. Con chess.js se puede ver la posición actual en notación PGN. Usando estos tres paquetes pude establecer la posición inicial y permitir al usuario hacer un movimiento, cuyo PGN se comparaba con el valor esperado. Si el movimiento coincidía, el puzzle continuaba, si no, se mostraba al usuario un mensaje de movimiento incorrecto y se le pedía que lo intentara de nuevo. El estilo y los controles se han hecho coincidir con los de chess.com para que resulten familiares. La chess-web-api también libera la notación de un ejercicios diario aleatorio de los archivos, que se actualiza cada 15 segundos permitiendo el acceso ilimitado y gratuito a ejercicios anteriores. Daily Chess Puzzle ha sido galardonado con una insignia destacada en la Chrome Store por por seguir las mejores prácticas técnicas y cumplir con un alto estándar de experiencia de usuario y diseño.",
  "dc-nf-1": "Ejercicios gratuitos ilimitados",
  "dc-nf-2": "Acceso directo desde el navegador",
  "dc-nf-3": "Estilo familiar de chess.com",
  "dc-nf-4": "Membresía no requerida",
  "dc-nf-5": "Botones de sugerencias, solución, reinicio y rotación del tablero",
  "dc-nf-6": "Enlaces directos a chess.com para más información",
  "dc-challenge": "¡Desafíame!",
  "go-blurb": "La aplicación web Goals permite a los usuarios hacer un seguimiento de sus objetivos anuales y ver su progreso en tiempo real. Tanto si quieren conseguir algo como dejar un mal hábito, esta aplicación les ayudará a mantenerse concentrado.",
  "go-description": "Las actualizaciones de tu progreso son esenciales para mantenerte motivado en la consecución de tus objetivos. Esta aplicación le permite seguir y ver su progreso en tiempo real, independientemente del tipo de objetivo. Los objetivos se dividen en categorías para mantener el enfoque en todas las metas.",
  "go-difficulties": "No todos los objetivos pueden medirse de la misma manera. Si quieres dejar o conseguir algo, hay que hacer un seguimiento de diferentes maneras. Algunos objetivos pueden marcarse con una casilla de verificación, mientras que otros pueden necesitar mostrarse con un valor objetivo. Con los valores objetivo, los usuarios necesitan poder escribir notas para reflexionar sobre cómo han progresado.",
  "go-solutions": "Los usuarios añaden submetas a las categorías de objetivos que conforman el valor del porcentaje de finalización. Los subobjetivos marcados y los objetivos se ponderan de manera uniforme, y el porcentaje de finalización de los objetivos se añade inmediatamente al porcentaje del objetivo. Esto permite una representación más precisa del progreso del usuario. Por ejemplo, si planea correr 1.000 km en un año, el porcentaje de finalización se actualizará con cada entrada y no sólo cuando se alcance el objetivo. Se pueden añadir notas a los objetivos para hacer un seguimiento de su progreso. Los objetivos pueden organizarse como el usuario considere oportuno y los subobjetivos se desplazan a la parte inferior una vez completados para pasar a centrarse en el siguiente objetivo.",
  "go-nf-1": "Actualizaciones de objetivos en tiempo real",
  "go-nf-2": "Establecer objetivos para lograr o dejar algo",
  "go-nf-3": "Subobjetivos de seguimiento de la cantidad con notas",
  "go-nf-4": "Subobjetivos de casilla para objetivos simples completos/incompletos",
  "go-nf-5": "Ruedas y barras de porcentajes con animaciones",
  "go-nf-6": "Organizar los objetivos",
  "go-nf-7": "Guardar en localStorage",
  "go-nf-8": "Citas de motivación",
  "skills-header": "Habilidades",
  "front-end": "Front-end",
  "back-end": "Back-end",
  "general": "General",
  "languages": "Idiomas",
  "en-name": "Inglés",
  "en-level": "Nativo",
  "es-name": "Español",
  "pt-name": "Portugués",
  "currently-learning": "Aprendizaje Actual",
  "get-in-touch": "¡Póngase en contacto!",
  "name": "Nombre",
  "email": "Email",
  "message": "Mensaje",
  "submit": "Enviar",
  "thank-you": "¡Gracias!",
  "success-message": "Me pondré en contacto con usted lo antes posible"
}
